In [2]:
import pandas as pd 
data = [10, 20, 30, 40, 50]
my_series = pd.Series(data, index =["o", "1", "2", "3", "4"])
print(my_series)

o    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
a = ["1","2","3"] 
my_series = pd.Series(a, index =["x", "y", "z"])
print(my_series)

x    1
y    2
z    3
dtype: object

In [1]:
import pandas as pd
data = [["1001", "Maggi", "Rs.200"],
        ["1002", "Ketchup Bottle", "Rs.150"],
        ["1003", "Aashirvad Atta(2kg)", "Rs.220"],
        ["1004", "Davidoff Coffee", "Rs.519"],
        ["1005", "Madhur Sugar(2kg)", "Rs.210"]] 
df = pd.DataFrame(data, columns=["Product Id", "Product Name", "Product Price"])
print(df)

  Product Id         Product Name Product Price
0       1001                Maggi        Rs.200
1       1002       Ketchup Bottle        Rs.150
2       1003  Aashirvad Atta(2kg)        Rs.220
3       1004      Davidoff Coffee        Rs.519
4       1005    Madhur Sugar(2kg)        Rs.210

In [57]:
a = ["1001", "1002", "1003", "1004", "1005"]
df = pd.DataFrame(a, columns=["Product Id"])
print(df)

  Product Id
0       1001
1       1002
2       1003
3       1004
4       1005

In [58]:
a = ["Maggi", "Ketchu Bottle", "Aashirvad Atta(2kg)", "Davidoff Coffee", "Madhur Sugar(2kg)"]
df = pd.DataFrame(a, columns=["Product Name"])
print(df)

          Product Name
0                Maggi
1        Ketchu Bottle
2  Aashirvad Atta(2kg)
3      Davidoff Coffee
4    Madhur Sugar(2kg)

In [59]:
a = ["Rs.200", "Rs.150", "Rs.220", "Rs.519", "Rs.210"]
df = pd.DataFrame(a, columns=["Product Price"])
print(df)

  Product Price
0        Rs.200
1        Rs.150
2        Rs.220
3        Rs.519
4        Rs.210

In [60]:
import pandas as pd

In [62]:
print(df.iloc[0])

Product Id         1001
Product Name      Maggi
Product Price    Rs.200
Name: 0, dtype: object

In [63]:
print(df.iloc[1])

Product Id                1002
Product Name     Ketchu Bottle
Product Price           Rs.150
Name: 1, dtype: object

In [64]:
print(df.iloc[2])

Product Id                      1003
Product Name     Aashirvad Atta(2kg)
Product Price                 Rs.220
Name: 2, dtype: object

In [65]:
print(df.iloc[3])

Product Id                  1004
Product Name     Davidoff Coffee
Product Price             Rs.519
Name: 3, dtype: object

In [66]:
print(df.iloc[4])

Product Id                    1005
Product Name     Madhur Sugar(2kg)
Product Price               Rs.210
Name: 4, dtype: object

In [69]:
print(df.loc[3:])

  Product Id       Product Name Product Price
3       1004    Davidoff Coffee        Rs.519
4       1005  Madhur Sugar(2kg)        Rs.210

In [73]:
print(df.iloc[2:3])

  Product Id         Product Name Product Price
2       1003  Aashirvad Atta(2kg)        Rs.220

In [76]:
print(df.iloc[2:5,0:2])

  Product Id         Product Name
2       1003  Aashirvad Atta(2kg)
3       1004      Davidoff Coffee
4       1005    Madhur Sugar(2kg)

In [97]:
print(df.iloc[1:4,-1])

1    Rs.150
2    Rs.220
3    Rs.519
Name: Product Price, dtype: object

In [3]:
import pandas as pd
data = [['Riya', '1', '66', '62', '68'],
        ['Siya', '2', '39', '61', '70'],
        ['Kiya', '3', '37', '60', '69'],
        ['Jiya', '4', '70', '76', '77']] 
df = pd.DataFrame(data, columns=['Name', 'RollNo.', 'Python','Data Science', 'DBMS'])   
print(df)

   Name RollNo. Python Data Science DBMS
0  Riya       1     66           62   68
1  Siya       2     39           61   70
2  Kiya       3     37           60   69
3  Jiya       4     70           76   77

In [61]:
import numpy as np
import pandas as pd
df=pd.DataFrame(np.random.randint(0,100,(4,3)),index=["Riya","Siya","kiya","Jiya"],columns=["Python","Data Science", "DBMS"])
df

      Python  Data Science  DBMS
Riya      40            46    56
Siya      95            40    59
kiya      96            42    66
Jiya      78            55    30

In [51]:
df.loc[df['Python']<40,'Python']=41

In [52]:
df

      Python  Data Science  DBMS
Riya      93            75    70
Siya      56            60    83
kiya      52            24    68
Jiya      44             3    40

In [55]:
df+2

      Python  Data Science  DBMS
Riya      95            77    72
Siya      58            62    85
kiya      54            26    70
Jiya      46             5    42

In [56]:
df[(df['Python']>50)&(df['Data Science']>60)]

      Python  Data Science  DBMS
Riya      93            75    70

In [72]:
# List of student names
student_names = ["Riya", "Siya", "Kiya", "Jiya"]

# Filter names starting with 'S'
filtered_names = [name for name in student_names if name.startswith('S')]

# Display filtered names
filtered_names                   question 11

['Siya']

In [77]:
# List of student names
student_names = ["Riya", "Siya", "Kiya", "Jiya"]

# Filter names starting with 'S'
filtered_names = [name for name in student_names if name.endswith('a')]

# Display filtered names
filtered_names                  question 12

['Riya', 'Siya', 'Kiya', 'Jiya']

In [85]:
# List of student records
student_records = [
    {"name": "Riya", "marks": [93, 75, 70]},
    {"name": "Siya", "marks": [56, 60, 83]},
    {"name": "Kiya", "marks": [52, 24, 68]},
    {"name": "Jiya", "marks": [44, 3, 40]}              question 13
]

# Calculate total and percentage for each student
for record in student_records:
    total_marks = sum(record["marks"])
    percentage = (total_marks / (len(record["marks"]) * 100)) * 100
    print(f"{record['name']}: Total Marks = {total_marks}, Percentage = {percentage}%")

Riya: Total Marks = 238, Percentage = 79.33333333333333%
Siya: Total Marks = 199, Percentage = 66.33333333333333%
Kiya: Total Marks = 144, Percentage = 48.0%
Jiya: Total Marks = 87, Percentage = 28.999999999999996%

In [86]:
# List of student records
student_records = [
    {"name": "Riya", "marks": [93, 75, 70]},
    {"name": "Siya", "marks": [56, 60, 83]},
    {"name": "Kiya", "marks": [52, 24, 68]},
    {"name": "Jiya", "marks": [44, 3, 40]}            question 14
]

# Calculate status (PASS / FAIL) for each student
for record in student_records:
    total_marks = sum(record["marks"])
    percentage = (total_marks / (len(record["marks"]) * 100)) * 100
    status = "PASS" if percentage >= 40 else "FAIL"
    print(f"{record['name']}: {status}")

Riya: PASS
Siya: PASS
Kiya: PASS
Jiya: FAIL

In [87]:
# List of student records
student_records = [
    {"name": "Riya", "marks": [93, 75, 70]},
    {"name": "Siya", "marks": [56, 60, 83]},
    {"name": "Kiya", "marks": [52, 24, 68]},
    {"name": "Jiya", "marks": [44, 3, 40]}
]

# Calculate grade for each student based on percentage
for record in student_records:
    total_marks = sum(record["marks"])
    percentage = (total_marks / (len(record["marks"]) * 100)) * 100
    if percentage >= 90:
        grade = 'A'
    elif percentage >= 80:
        grade = 'B'                                   question 15
    elif percentage >= 70:
        grade = 'C'
    elif percentage >= 60:
        grade = 'D'
    elif percentage >= 50:
        grade = 'E'
    else:
        grade = 'F'
    print(f"{record['name']}: Grade = {grade}")

Riya: Grade = C
Siya: Grade = D
Kiya: Grade = F
Jiya: Grade = F

In [91]:
import pandas as pd
import numpy as np

df = pd.DataFrame(student_records)

numeric_columns = df.select_dtypes(include=[np.number])
summary_stats = {
    'Total': numeric_columns.sum(),
    'Maximum': numeric_columns.max(),
    'Minimum': numeric_columns.min(),
    'Standard Deviation': numeric_columns.std()
}
                                                                  question 16
print("Summary Statistics:")
print(summary_stats)

df.to_excel("student_records.xlsx", index=False)
df.to_json("student_records.json", orient="records")
df.to_html("student_records.html", index=False)

Summary Statistics:
{'Total': Series([], dtype: float64), 'Maximum': Series([], dtype: float64), 'Minimum': Series([], dtype: float64), 'Standard Deviation': Series([], dtype: float64)}

In [51]:
print("Metadata for each column:")
print(df.info())
                                                      question 17                                 
print("Detailed metadata for numeric columns:")
print(df.describe())

Metadata for each column:
<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Riya to Jiya
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Python        4 non-null      int32
 1   Data Science  4 non-null      int32
 2   DBMS          4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes
None
Detailed metadata for numeric columns:
          Python  Data Science       DBMS
count   4.000000      4.000000   4.000000
mean   15.500000     64.250000  69.500000
std    10.472185     13.598407  39.770173
min     6.000000     49.000000  11.000000
25%     6.750000     56.500000  62.750000
50%    15.000000     63.500000  84.000000
75%    23.750000     71.250000  90.750000
max    26.000000     81.000000  99.000000

In [93]:
data_dict = df.to_dict(orient='records')
                                                          question 18                               
print(data_dict)

[{'name': 'Riya', 'marks': [93, 75, 70]}, {'name': 'Siya', 'marks': [56, 60, 83]}, {'name': 'Kiya', 'marks': [52, 24, 68]}, {'name': 'Jiya', 'marks': [44, 3, 40]}]

In [13]:
# Add 500 to each element in the 'Product Price' column
for record in data dict:
    record['ProductPrice'] += 500

# Create a new DataFrame from the updated dictionary
new_df = pd.DataFrame("data dict")
                                                       question 19
# Display the new DataFrame  
print(new_df)

SyntaxError: invalid syntax (3354107590.py, line 2)

In [22]:
productId = [101, 102, 103, 104, 105]
productName = ['Maggi', 'Ketchup Bottle', 'Aashirvad Atta(2kg)', 'Davidoff Coffee', 'Madhur Sugar(2kg)']
productPrice = ["Rs.200", "Rs.150", "Rs.220", "Rs.519", "Rs.210"]

data = {'ProductID': productId, 'ProductName': productName, 'ProductPrice': productPrice}
df = pd.DataFrame(data)                             question 1

In [23]:
df                         question 1

   ProductID          ProductName ProductPrice
0        101                Maggi       Rs.200
1        102       Ketchup Bottle       Rs.150
2        103  Aashirvad Atta(2kg)       Rs.220
3        104      Davidoff Coffee       Rs.519
4        105   Madhur Sugar(2kg})       Rs.210

In [25]:
print("Extracted Product ID Column:")
print(df['ProductID'])
print("\nExtracted Product Name Column:")
print(df['ProductName'])
print("\nExtracted Product Price Column:")
print(df['ProductPrice'])                           question 2

Extracted Product ID Column:
0    101
1    102
2    103
3    104
4    105
Name: ProductID, dtype: int64

Extracted Product Name Column:
0                  Maggi
1         Ketchup Bottle
2    Aashirvad Atta(2kg)
3        Davidoff Coffee
4     Madhur Sugar(2kg})
Name: ProductName, dtype: object

Extracted Product Price Column:
0    Rs.200
1    Rs.150
2    Rs.220
3    Rs.519
4    Rs.210
Name: ProductPrice, dtype: object

In [26]:
print("\nEach row separately using iloc:")
for i in range(len(df)):
    print(df.iloc[i])                        question 3

Each row separately using iloc:
ProductID          101
ProductName      Maggi
ProductPrice    Rs.200
Name: 0, dtype: object
ProductID                  102
ProductName     Ketchup Bottle
ProductPrice            Rs.150
Name: 1, dtype: object
ProductID                       103
ProductName     Aashirvad Atta(2kg)
ProductPrice                 Rs.220
Name: 2, dtype: object
ProductID                   104
ProductName     Davidoff Coffee
ProductPrice             Rs.519
Name: 3, dtype: object
ProductID                      105
ProductName     Madhur Sugar(2kg})
ProductPrice                Rs.210
Name: 4, dtype: object

In [27]:
print("\nProduct Name from 3rd row using loc:")
print(df.loc[2, 'ProductName'])                  question 4

Product Name from 3rd row using loc:
Aashirvad Atta(2kg)

In [28]:
print("\nPrice located in 2nd row using iloc:")
print(df.iloc[1]['ProductPrice'])                  question 5

Price located in 2nd row using iloc:
Rs.150

In [29]:
print("\n2nd to 4th row data excluding price:")
print(df.iloc[1:4, :-1])                       question 6

2nd to 4th row data excluding price:
   ProductID          ProductName
1        102       Ketchup Bottle
2        103  Aashirvad Atta(2kg)
3        104      Davidoff Coffee

In [30]:
print("\n1 to 3rd row price data only:")
print(df.iloc[:3, 2])                  question 7

1 to 3rd row price data only:
0    Rs.200
1    Rs.150
2    Rs.220
Name: ProductPrice, dtype: object

In [ ]:
import numpy as np
import pandas as pd
df=pd.DataFrame(np.random.randint(0,100,(4,3)),index=["Riya","Siya","kiya","Jiya"],columns=["Python","Data Science", "DBMS"])
df

      Python  Data Science  DBMS
Riya      23            59    80
Siya       7            68    11
kiya      26            49    99
Jiya       6            81    88